export default {
  processing: "Күте тұрыңыз...",
  search: "Іздеу:",
  lengthMenu: "_MENU_ жазба көрсету",
  info: "_TOTAL_ жазбаның _START_ бастап _END_ дейінгісі көрсетілуде",
  infoEmpty: "0 жазбадан 0 бастап 0 дейінгі көрсетілуде",
  infoFiltered: "(_MAX_ жазбадан сүзілді)",
  infoPostFix: "",
  loadingRecords: "Жазбалар жүктелуде...",
  zeroRecords: "Сәйкес жазбалар табылмады",
  emptyTable: "Кестеде деректер жоқ",
  paginate: {
    first: "Бірінші",
    previous: "Алдыңғы",
    next: "Келесі",
    last: "Соңғы"
  },
  aria: {
    sortAscending: ": өсу ретімен сұрыптау үшін белсендіріңіз",
    sortDescending: ": кему ретімен сұрыптау үшін белсендіріңіз"
  },
  select: {
    rows: {
      "_": "%d жол таңдалды",
      "0": "Таңдау үшін жолды басыңыз",
      "1": "1 жол таңдалды"
    }
  },
  buttons: {
    print: "Басып шығару",
    colvis: "Бағандарды көрсету",
    copy: "Көшіру",
    copyTitle: "Буферге көшіру",
    copySuccess: {
      "_": "%d жол буферге көшірілді",
      "1": "1 жол буферге көшірілді"
    }
  },
  editor: {
    close: "Жабу",
    create: {
      button: "Жаңа",
      title: "Жаңа жазба жасау",
      submit: "Жасау"
    },
    edit: {
      button: "Өзгерту",
      title: "Жазбаны өзгерту",
      submit: "Жаңарту"
    },
    remove: {
      button: "Жою",
      title: "Жою",
      submit: "Жою",
      confirm: {
        "_": "%d жолды жоюды растайсыз ба?",
        "1": "1 жолды жоюды растайсыз ба?"
      }
    },
    error: {
      system: "Жүйелік қате орын алды"
    },
    multi: {
      title: "Бірнеше мән",
      info: "Таңдалған элементтер бұл өріс үшін әртүрлі мәндерді қамтиды. Барлық таңдалған элементтер үшін бұл өрісті бір мәнге орнату үшін осы жерді басыңыз, әйтпесе олар жеке мәндерін сақтайды.",
      restore: "Өзгерістерді болдырмау",
      noMulti: "Бұл өрісті жеке өңдеуге болады, бірақ топтың бөлігі ретінде емес."
    }
  }
};
