export default {
  processing: "Подождите...",
  search: "Поиск:",
  lengthMenu: "Показать _MENU_ записей",
  info: "Записи с _START_ до _END_ из _TOTAL_ записей",
  infoEmpty: "Записи с 0 до 0 из 0 записей",
  infoFiltered: "(отфильтровано из _MAX_ записей)",
  infoPostFix: "",
  loadingRecords: "Загрузка записей...",
  zeroRecords: "Записи отсутствуют",
  emptyTable: "В таблице отсутствуют данные",
  paginate: {
    first: "Первая",
    previous: "Предыдущая",
    next: "Следующая",
    last: "Последняя"
  },
  aria: {
    sortAscending: ": активировать для сортировки столбца по возрастанию",
    sortDescending: ": активировать для сортировки столбца по убыванию"
  },
  select: {
    rows: {
      _: "Выбрано записей: %d",
      0: "Кликните по записи для выбора",
      1: "Выбрана одна запись"
    }
  },
  buttons: {
    print: "Печать",
    colvis: "Видимость колонок",
    copy: "Копировать",
    copyTitle: "Копировать в буфер обмена",
    copySuccess: {
      _: "Скопировано %d строк",
      1: "Скопирована 1 строка"
    }
  },
  editor: {
    close: "Закрыть",
    create: {
      button: "Новый",
      title: "Создать новую запись",
      submit: "Создать"
    },
    edit: {
      button: "Изменить",
      title: "Изменить запись",
      submit: "Изменить"
    },
    remove: {
      button: "Удалить",
      title: "Удалить",
      submit: "Удалить",
      confirm: {
        _: "Вы уверены, что хотите удалить %d строк?",
        1: "Вы уверены, что хотите удалить 1 строку?"
      }
    },
    error: {
      system: "Возникла системная ошибка"
    },
    multi: {
      title: "Разные значения",
      info: "Выбранные элементы содержат разные значения для этого поля. Чтобы изменить и установить для всех элементов одинаковое значение, нажмите или коснитесь здесь, в противном случае они сохранят свои индивидуальные значения.",
      restore: "Отменить изменения",
      noMulti: "Это поле можно редактировать индивидуально, но не как часть группы"
    }
  }
};
